# Add CSS

브라우저는 CSS를 읽을 때  HTML형식으로 읽는다

CSS를 삽입하는 방법은 3가지가 있다

외부 CSS
내부 CSS
인라인 CSS

# 외부 CSS
---------------------------------
외부 스타일 시트를 이용하면 하나의 파일만 변경하여 여러 웹사이트를 변경할 수 있다.

각 HTML 페이지에는 헤드 섹션 내부의 링크 요소 내부에있는 외부 스타일 시트 파일에 대한 참조가 포함되어야한다.

외부 스타일 시트는 아무 텍스트 에디터로 쓸 수 있으며 확장자를 .CSS로 저장해야한다

CSS파일은 HTML안애서는 만들 수 없다

# 내부 CSS
-------------------

하나의 단일 HTML페이지에 사용할 경우 내부 CSS를 이용할 수 있다

내부 CSS는 head에 있는 \<style> 태그에 정의된다

# 인라인 CSS
------------------------
하나의 요소에 고유의 스타일을 넣을 때 사용한다

관련 요소에 스타일속성을 추가하면 사용할 수 있다

서로다른 시트에서 하나의 요소에 스타일을 입힐경우 가장 마지막에 한값이 적용된다
